# Task_01 -----------------------------------------------------
a = int(input('Введіть ціле число:'))
b = int(input('Введіть ціле число:'))
c = float(input('Введіть десятковий дріб:'))
d = float(input("Введіть десятковий дріб:"))

# Task_02 -----------------------------------------------------
myList = []
for e in [a + b, b - c, c / d, d * a, b % c, d // b, c ** a]:
    myList.append(round(e, 2))

print("Результат виконання: ", myList)
# Task_03 -----------------------------------------------------

print("Кількість елементів у списку: ", len(myList))
print("Список парних елементів з попереднього:", myList[1::2])
# Task_04 -----------------------------------------------------

temp = myList[1]
myList[1] = myList[4]
myList[4] = temp
print("Список із зміненими елементами:", myList)

# Task_05 -----------------------------------------------------

name = input("Введіть ім'я: ")
print("---> Виконав роботу", name, )
print("Висновок:\n"
      "В цій лабораторній роботі було ознайомлено з лінійним алгоритмом на мові Python.\n"
      "Також було розглянуто - Інтегроване середовище розробки (IDE).")
